![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/images/IDSNlogo.png)

# Hands-on Lab: Built-in functions - Aggregate, Scalar, String, Date and Time Functions

Now letâ€™s practice using sub-queries and working with multiple tables. Use the PETRESCUE-CREATE.sql file provided to create the table and execute the queries in the last two videos.

| ID     | ANIMAL   | QUANTITY   | COST      | RESCUEDATE   |
| ------ | -------- | ---------- | --------- | ------------ |
| 1	     | Cat	    | 9	         | 450.09	 | 5/29/2018    |
| 2	     | Dog	    | 3	         | 666.66	 | 6/1/2018     |
| 3	     | Dog	    | 1	         | 100	     | 6/4/2018     |
| 4	     | Parrot   | 2	         | 50	     | 6/4/2018     |
| 5	     | Dog	    | 1	         | 75.75	 | 6/10/2018    |
| 6	     | Hamster  | 6	         | 60.6	     | 6/11/2018    |
| 7	     | Cat      | 1	         | 44.44 	 | 6/11/2018    |
| 8	     | Goldfish | 24	     | 48.48	 | 6/14/2018    |
| 9	     | Dog	    | 2	         | 222.22	 | 6/15/2018    |

## Objectives

After completing this lab, you will be able to:

1. Compose and run sub-queries with multiple tables
2. Check query results and view log files

Compose and run the following queries. Check that the results are what you expect and remember to view the logs in the Results section for errors and warnings.

**Note**: The solutions are provided at the end of this lab, but please try to compose the queries on your own before checking the solutions.

## NOTE : Make sure that you are using the CSV file and datasets from the same instruction file.

In [6]:
import sqlite3
import pandas as pd

In [7]:
con = sqlite3.connect('data/database.db')
cur = con.cursor()

# Exercise 1: Create the Pet Rescue table

Rather than create the table manually by typing the DDL commands in the SQL editor, you will execute a script containing the create table command.

1. Download the script file [PETRESCUE-CREATE.sql](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/datasets/PETSALE_PETRESCUE/PETRESCUE-CREATE.sql)

**Note**: To download, just right-click on the link above and click on **Save As..** or **Save Link As...** depending on your browser. Save the file as a .sql file and not HTML.

2. Login to IBM Cloud and go to the Resources Dashboard: https://cloud.ibm.com/resources where you can find the Db2 service that you created in a previous Lab. Click on the **Db2-xx** service. Next, open the Db2 Console by clicking on **Open Console** button. Go to the **Run SQL** page. The Run SQL tool enables you to run DDL and SQL statements.

3. Click on the + (Add New Script) icon.

4. Click on **From File**.

5. Locate the file **PETRESCUE-CREATE.sql** that you downloaded to your computer earlier and open it.

6. Once the statements are in the SQL Editor tool, you can run the queries against the database by selecting the **Run all** button.

7. On the right side of the SQL editor window you will see a **Result** section. Clicking on a query in the Result section will show the execution details of the job - whether it ran successfully or had any errors or warnings. Ensure your queries ran successfully and created all the tables.

8. Now you can look at the tables you created. Navigate to the three-bar menu icon, select **Explore**, then click on **Tables**.

9. Select the Schema corresponding to your Db2 userid. Then on the right side of the screen you should see the newly created **PETRESCUE** table listed (plus any other tables you may have created in previous labs e.g. INSTRUCTOR, TEST, etc.).

10. Click on any of the tables and you will see its SCHEMA definition (that is list of columns, their data types, and so on). You can also click **View Data** to view the content of the table.

In [13]:
query = '''
            SELECT *
            FROM PETRESCUE
        '''
df = pd.read_sql_query(query, con)
df

   ID    ANIMAL  QUANTITY    COST  RESCUEDATE
0   1       Cat         9  450.09  2018-05-29
1   2       Dog         3  666.66  2018-06-01
2   3       Dog         1  100.00  2018-06-04
3   4    Parrot         2   50.00  2018-06-04
4   5       Dog         1   75.75  2018-06-10
5   6   Hamster         6   60.60  2018-06-11
6   7       Cat         1   44.44  2018-06-11
7   8  Goldfish        24   48.48  2018-06-14
8   9       Dog         2  222.22  2018-06-15

# Exercise 2: Aggregate Functions

**Query A1**: Enter a function that calculates the total cost of all animal rescues in the PETRESCUE table.

In [9]:
query = '''
            SELECT SUM(COST)
            FROM PETRESCUE
        '''
df = pd.read_sql_query(query, con)
df

   SUM(COST)
0    1718.24

**Query A2**: Enter a function that displays the total cost of all animal rescues in the PETRESCUE table in a column called SUM_OF_COST.

In [10]:
query = '''
            SELECT SUM(COST) AS SUM_OF_COST
            FROM PETRESCUE
        '''
df = pd.read_sql_query(query, con)
df

   SUM_OF_COST
0      1718.24

**Query A3**: Enter a function that displays the maximum quantity of animals rescued.

In [12]:
query = '''
            SELECT MAX(QUANTITY)
            FROM PETRESCUE
        '''
df = pd.read_sql_query(query, con)
df

   MAX(QUANTITY)
0             24

**Query A4**: Enter a function that displays the average cost of animals rescued.

In [14]:
query = '''
            SELECT AVG(COST)
            FROM PETRESCUE
        '''
df = pd.read_sql_query(query, con)
df

    AVG(COST)
0  190.915556

**Query A5**: Enter a function that displays the average cost of rescuing a dog.

In [17]:
query = '''
            SELECT AVG(COST/QUANTITY)
            FROM PETRESCUE
            WHERE ANIMAL == 'Dog'
        '''
df = pd.read_sql_query(query, con)
df

   AVG(COST/QUANTITY)
0              127.27

# Exercise 3: Scalar and String Functions

**Query B1**: Enter a function that displays the rounded cost of each rescue.

In [19]:
query = '''
            SELECT ROUND(COST)
            FROM PETRESCUE
        '''
df = pd.read_sql_query(query, con)
df

   ROUND(COST)
0        450.0
1        667.0
2        100.0
3         50.0
4         76.0
5         61.0
6         44.0
7         48.0
8        222.0

**Query B2**: Enter a function that displays the length of each animal name.

In [20]:
query = '''
            SELECT LENGTH(ANIMAL)
            FROM PETRESCUE
        '''
df = pd.read_sql_query(query, con)
df

   LENGTH(ANIMAL)
0               3
1               3
2               3
3               6
4               3
5               7
6               3
7               8
8               3

**Query B3**: Enter a function that displays the animal name in each rescue in uppercase.

In [22]:
query = '''
            SELECT UPPER(ANIMAL)
            FROM PETRESCUE
        '''
df = pd.read_sql_query(query, con)
df

  UPPER(ANIMAL)
0           CAT
1           DOG
2           DOG
3        PARROT
4           DOG
5       HAMSTER
6           CAT
7      GOLDFISH
8           DOG

**Query B4**: Enter a function that displays the animal name in each rescue in uppercase without duplications.

In [28]:
query = '''
            SELECT DISTINCT(UPPER(ANIMAL))
            FROM PETRESCUE
        '''
df = pd.read_sql_query(query, con)
df

  (UPPER(ANIMAL))
0             CAT
1             DOG
2          PARROT
3         HAMSTER
4        GOLDFISH

**Query B5**: Enter a query that displays all the columns from the PETRESCUE table, where the animal(s) rescued are cats. Use **cat** in lower case in the query.

In [31]:
query = '''
            SELECT *
            FROM PETRESCUE
            WHERE LOWER(ANIMAL) == 'cat'
        '''
df = pd.read_sql_query(query, con)
df

   ID ANIMAL  QUANTITY    COST  RESCUEDATE
0   1    Cat         9  450.09  2018-05-29
1   7    Cat         1   44.44  2018-06-11

# Exercise 4: Date and Time Functions

**Query C1**: Enter a function that displays the day of the month when cats have been rescued.

In [39]:
query = '''
            SELECT STRFTIME('%d', RESCUEDATE)
            FROM PETRESCUE
            WHERE ANIMAL == 'Cat'
        '''
df = pd.read_sql_query(query, con)
df

  STRFTIME('%d', RESCUEDATE)
0                         29
1                         11

**Query C2**: Enter a function that displays the number of rescues on the 5th month.

In [44]:
query = '''
            SELECT SUM(QUANTITY)
            FROM PETRESCUE
            WHERE STRFTIME('%m', RESCUEDATE) == '05'
        '''
df = pd.read_sql_query(query, con)
df

   SUM(QUANTITY)
0              9

**Query C3**: Enter a function that displays the number of rescues on the 14th day of the month.

In [45]:
query = '''
            SELECT SUM(QUANTITY)
            FROM PETRESCUE
            WHERE STRFTIME('%d', RESCUEDATE) == '14'
        '''
df = pd.read_sql_query(query, con)
df

   SUM(QUANTITY)
0             24

**Query C4**: Animals rescued should see the vet within three days of arrivals. Enter a function that displays the third day from each rescue.

In [55]:
query = '''
            SELECT DATE(RESCUEDATE, '+3 days')
            FROM PETRESCUE
        '''
df = pd.read_sql_query(query, con)
df

  DATE(RESCUEDATE, '+3 days')
0                  2018-06-01
1                  2018-06-04
2                  2018-06-07
3                  2018-06-07
4                  2018-06-13
5                  2018-06-14
6                  2018-06-14
7                  2018-06-17
8                  2018-06-18

**Query C5**: Enter a function that displays the length of time the animals have been rescued; the difference between todayâ€™s date and the rescue date.

# Lab Solutions

# Exercise 2 Solutions: Aggregate Functions

**Query A1**: Enter a function that calculates the total cost of all animal rescues in the PETRESCUE table.

```sql
select SUM(COST) from PETRESCUE;
```

**Query A2**: Enter a function that displays the total cost of all animal rescues in the PETRESCUE table in a column called SUM_OF_COST.

```sql
select SUM(COST) AS SUM_OF_COST from PETRESCUE;
```

**Query A3**: Enter a function that displays the maximum quantity of animals rescued.

```sql
select MAX(QUANTITY) from PETRESCUE;
```

**Query A4**: Enter a function that displays the average cost of animals rescued.

```sql
select AVG(COST) from PETRESCUE;
```

**Query A5**: Enter a function that displays the average cost of rescuing a dog. Hint - Bear in my the cost of rescuing one dog on day, is different from another day. So you will have to use and average of averages.

```sql
select AVG(COST/QUANTITY) from PETRESCUE where ANIMAL = 'Dog';
```

# Exercise 3 Solutions: Scalar and String Functions

**Query B1**: Enter a function that displays the rounded cost of each rescue.

```sql
select ROUND(COST) from PETRESCUE;
```

**Query B2**: Enter a function that displays the length of each animal name.

```sql
select LENGTH(ANIMAL) from PETRESCUE;
```

**Query B3**: Enter a function that displays the animal name in each rescue in uppercase.

```sql
select UCASE(ANIMAL) from PETRESCUE;
```

**Query B4**: Enter a function that displays the animal name in each rescue in uppercase without duplications.

```sql
select DISTINCT(UCASE(ANIMAL)) from PETRESCUE;
```

**Query B5**: Enter a query that displays all the columns from the PETRESCUE table, where the animal(s) rescued are cats. Use cat in lower case in the query.

```sql
select * from PETRESCUE where LCASE(ANIMAL) = 'cat';
```

# Exercise 4 Solutions: Date and Time Functions

**Query C1**: Enter a function that displays the day of the month when cats have been rescued.

```sql
select DAY(RESCUEDATE) from PETRESCUE where ANIMAL = 'Cat';
```

**Query C2**: Enter a function that displays the number of rescues on the 5th month.

```sql
select SUM(QUANTITY) from PETRESCUE where MONTH(RESCUEDATE)='05';
```

**Query C3**: Enter a function that displays the number of rescues on the 14th day of the month.

```sql
select SUM(QUANTITY) from PETRESCUE where DAY(RESCUEDATE)='14';
```

**Query C4**: Animals rescued should see the vet within three days of arrivals. Enter a function that displays the third day from each rescue.

```sql
select (RESCUEDATE + 3 DAYS) from PETRESCUE;
```

**Query C5**: Enter a function that displays the length of time the animals have been rescued; the difference between todayâ€™s date and the recue date.

```sql
select (CURRENT DATE - RESCUEDATE) from PETRESCUE;
```

# Summary

You can now compose and run queries, check results and view the logs. You will use these skills in later labs.

In [71]:
con.close()

# Author(s)

### Rav Ahuja

## Changelog

| Date              | Version | Changed By          | Change Description                                                                            |
| ----------------- | ------- | ------------------- | --------------------------------------------------------------------------------------------- |
| 2021-07-15        | 1.4     | Malika              | Added hint to A5 solution                                                                     |
| 2020-06-29        | 1.3     | Rose Malcolm        | Added new Ex.1 to create table form sql file. Renumbered remaining exercises and solutions.   |
| 2020-06-26        | 1.2     | Steve Hord          | Replace quotes                                                                                |
| 2020-06-25        | 1.1     | Steve Hord          | Replace quotes                                                                                |
| 05-Jun-20         | 1.0     | Rose Malcolm        | Initial version created                                                                       |

## <h3 align="center"> Â© IBM Corporation 2020. All rights reserved. <h3/>